spec/cassettes/apply_vat_idempotent.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[vat_registered]=false&metadata[vat_number]=NL123&metadata[accounting_id]=10001&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '217'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:18 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1457'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1412000297,
          "id": "cus_4robLYOvRAQEEv",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "vat_number": "NL123",
            "accounting_id": "10001",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4robLYOvRAQEEv/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4robLYOvRAQEEv/cards",
            "data": [
              {
                "id": "card_14i4yj2nHroS7mLXiM2K11zi",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4robLYOvRAQEEv",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14i4yj2nHroS7mLXiM2K11zi"
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:18 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4robLYOvRAQEEv&amount=100&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '51'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:19 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '292'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14i4yk2nHroS7mLXtd2AgU63",
          "date": 1412000298,
          "amount": 100,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4robLYOvRAQEEv",
          "description": null,
          "metadata": {},
          "invoice": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:19 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices
    body:
      encoding: US-ASCII
      string: customer=cus_4robLYOvRAQEEv
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '27'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:20 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1265'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1412000299,
          "id": "in_14i4yl2nHroS7mLXaLOcu5Tw",
          "period_start": 1412000299,
          "period_end": 1412000299,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw/lines",
            "data": [
              {
                "id": "ii_14i4yk2nHroS7mLXtd2AgU63",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1412000298,
                  "end": 1412000298
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_4robLYOvRAQEEv",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1412003899,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:20 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:20 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1271'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1412000299,
          "id": "in_14i4yl2nHroS7mLXaLOcu5Tw",
          "period_start": 1412000299,
          "period_end": 1412000299,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw/lines",
            "data": [
              {
                "id": "ii_14i4yk2nHroS7mLXtd2AgU63",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1412000298,
                  "end": 1412000298
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_4robLYOvRAQEEv",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1412003899,
          "webhooks_delivered_at": 1412000299,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:20 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4robLYOvRAQEEv
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:21 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1458'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1412000297,
          "id": "cus_4robLYOvRAQEEv",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "vat_number": "NL123",
            "accounting_id": "10001",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4robLYOvRAQEEv/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4robLYOvRAQEEv/cards",
            "data": [
              {
                "id": "card_14i4yj2nHroS7mLXiM2K11zi",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4robLYOvRAQEEv",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14i4yj2nHroS7mLXiM2K11zi"
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:21 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4robLYOvRAQEEv&invoice=in_14i4yl2nHroS7mLXaLOcu5Tw&amount=21&currency=usd&description=VAT%20(21%25)&metadata[type]=vat&metadata[amount]=21&metadata[rate]=21
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '169'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:22 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '382'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14i4yo2nHroS7mLXNOkZkNnF",
          "date": 1412000302,
          "amount": 21,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4robLYOvRAQEEv",
          "description": "VAT (21%)",
          "metadata": {
            "type": "vat",
            "amount": "21",
            "rate": "21"
          },
          "invoice": "in_14i4yl2nHroS7mLXaLOcu5Tw",
          "subscription": null
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:22 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1779'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1412000299,
          "id": "in_14i4yl2nHroS7mLXaLOcu5Tw",
          "period_start": 1412000299,
          "period_end": 1412000299,
          "lines": {
            "object": "list",
            "total_count": 2,
            "has_more": false,
            "url": "/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw/lines",
            "data": [
              {
                "id": "ii_14i4yk2nHroS7mLXtd2AgU63",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1412000298,
                  "end": 1412000298
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              },
              {
                "id": "ii_14i4yo2nHroS7mLXNOkZkNnF",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 21,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1412000302,
                  "end": 1412000302
                },
                "quantity": null,
                "plan": null,
                "description": "VAT (21%)",
                "metadata": {
                  "type": "vat",
                  "amount": "21",
                  "rate": "21"
                }
              }
            ],
            "count": 2
          },
          "subtotal": 121,
          "total": 121,
          "customer": "cus_4robLYOvRAQEEv",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 121,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1412003899,
          "webhooks_delivered_at": 1412000299,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:23 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4robLYOvRAQEEv
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Sep 2014 14:18:24 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2183'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1412000299,
              "id": "in_14i4yl2nHroS7mLXaLOcu5Tw",
              "period_start": 1412000299,
              "period_end": 1412000299,
              "lines": {
                "object": "list",
                "total_count": 2,
                "has_more": false,
                "url": "/v1/invoices/in_14i4yl2nHroS7mLXaLOcu5Tw/lines",
                "data": [
                  {
                    "id": "ii_14i4yk2nHroS7mLXtd2AgU63",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 100,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1412000298,
                      "end": 1412000298
                    },
                    "quantity": null,
                    "plan": null,
                    "description": null,
                    "metadata": {}
                  },
                  {
                    "id": "ii_14i4yo2nHroS7mLXNOkZkNnF",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 21,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1412000302,
                      "end": 1412000302
                    },
                    "quantity": null,
                    "plan": null,
                    "description": "VAT (21%)",
                    "metadata": {
                      "type": "vat",
                      "amount": "21",
                      "rate": "21"
                    }
                  }
                ],
                "count": 2
              },
              "subtotal": 121,
              "total": 121,
              "customer": "cus_4robLYOvRAQEEv",
              "object": "invoice",
              "attempted": false,
              "closed": false,
              "forgiven": false,
              "paid": false,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 121,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": null,
              "next_payment_attempt": 1412003899,
              "webhooks_delivered_at": 1412000299,
              "charge": null,
              "discount": null,
              "application_fee": null,
              "subscription": null,
              "metadata": {},
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Mon, 29 Sep 2014 14:18:24 GMT
recorded_with: VCR 2.9.2
